# Реалізуйте двійковий пошук для відсортованого масиву з дробовими числами.
# Написана функція для двійкового пошуку повинна повертати кортеж,
# де першим елементом є кількість ітерацій, потрібних для знаходження елемента.
# Другим елементом має бути "верхня межа" — це найменший елемент, який є більшим або рівним заданому значенню.

# Виконання коду повертає кортеж,
# де першим елементом є кількість ітерацій, потрібних для знаходження елемента.
# Другим елементом є "верхня межа" (найменший елемент, який є більшим або рівним заданому значенню).


def binary_search(arr, target):
    """Виконує двійковий пошук для знаходження верхньої межі заданого значення в відсортованому масиві."""

    low = 0
    high = len(arr) - 1
    mid = 0

    iterations = 0
    upper_bound = None

    while low <= high:
        iterations += 1
        mid = (high + low) // 2

        # Якщо target більше за значення посередині списку, ігноруємо ліву половину, будемо шукати в елементах праворуч від mid
        if target > arr[mid]:
            low = mid + 1
        # Якщо target менше за значення посередині списку, ігноруємо праву половину, будемо шукати в елементах ліворуч від mid
        elif arr[mid] > target:
            high = mid - 1
            upper_bound = arr[mid]
        # інакше target присутній на mid позиції
        else:
            upper_bound = arr[mid]
            break

    return (iterations, upper_bound)


# Приклад використання:
sorted_array = [1.1, 2.3, 3.5, 4.7, 5.9, 6.0, 7.2]
target_value = 5.0
result = binary_search(sorted_array, target_value)
print(f"Результат двійкового пошуку для {target_value} в {sorted_array}: {result}")
assert result == (3, 5.9), "Тест не пройдено!"

sorted_array = [1.1, 2.3, 3.5, 5.0, 5.9, 6.0, 7.2, 8.4, 9.6]
target_value = 5.0
result = binary_search(sorted_array, target_value)
print(f"Результат двійкового пошуку для {target_value} в {sorted_array}: {result}")
assert result == (4, 5.0), "Тест не пройдено!"
